{
    "translation":{

        "NavBar":{
            "Letreiro": "   🟢 AVAILABLE FOR FREELANCER WORK!!  ",
            "DownMenu": {
                "open": "Close",
                "close": "Menu",
                "about": "About Me",
                "contact": "Contact",
                "work": "Work",
                "projects": "Projects",
                "courses": "YouTube",
                "publications": "Publications"
            }
        },
        
        "home": {
            "title": "hi there i'm ",
            "description": "I plan, write and develop web applications",
            "description2": "I love challenges and am always looking for creative solutions.",
            "button": "Hire me!",
            "aboutme": "About me",
            "aboutme1": "I've always been passionate about technology and am currently focusing on deepening my knowledge in front-end applications, using React and React Native. I'm specializing in this area through the use of frameworks and libraries like Next.js, among others."
        },

        "me":{
            "hi": "Greetings, a little about me.",
            "technologies": "Technologies",
            "about": "My name is Antônio Lisboa. I have always been passionate about technology and currently I am dedicating myself to deepening my knowledge in front-end oriented applications, using React and React Native. I am specializing in this area through the use of frameworks and libraries like Next.js, among others. Additionally, I have had contact with preprocessors such as SASS/SCSS, Tailwind CSS, and Bootstrap. I also have experience in code versioning using Git/GitHub and Gitflow.",
            "about2": "I am studying Computer Science at UFC, where I have the opportunity to expand my knowledge and apply it in practical projects. With extensive experience in SQL databases and a strong performance as a data analyst in NoSQL databases, including the completion of mini-courses on the subject, I have also developed communication skills through participation in theatrical plays. Throughout my professional journey, I have acquired valuable skills such as teamwork, proactivity, decision-making, and commitment to deadlines.",
            "experience":"Professional experience",
            "experience2":"Database Analyst (MongoDB), NERDS, UFC","experience2.1":"April 2023 - February 2024",
            "experience3":"Full Stack Developer Intern, LUDI, UFC","experience3.1":"February 2024 – present",
            "curriculum": "Curriculum", "curriculum1": "For more information, download my resume"
        },

        "contact":{
            "title": "Contact",
            "name": "Name",
            "message": "what do you have in mind?",
            "button":"Submit",
            "error":{
                "message": "Minimum 20 characters.",
                "name":"Minimum 5 characters.",
                "email":"Invalid email"
            }
        },
        
        "Footer": {
            "companyName": "Antônio Lisboa",
            "rightsReserved": "All rights reserved."
        },

        "project":{
            "title":"My Projects",
            "technologies": "Technologies Used",
            "click": "Project page"
        },


        "projects": {
            "project3": {
                "title": "Turtle Game",
                "description": "A game in Python developed with Turtle",
                "text": "This game was developed for the FUP course, starting the experience with Python and games.",
                "link": "https://github.com/LisboaAnt/Turtle-game-FUP",
                "youtube": "https://youtu.be/ImY4Rq1fjeY?si=Pnpz1hzYpookiEyn",
                "technologies": ["Python", "Turtle"],
                "photo": "/img/projects/project3.png",
                "status": "Completed🟢"
            },
            "project4": {
                "title": "YouTube Shorts to Text AI",
                "description": "Convert YouTube Shorts into text",
                "text": "This project is a web application that uses artificial intelligence to convert YouTube Shorts into text, offering automatic subtitles.",
                "link": "https://github.com/LisboaAnt/YouTube-Shorts-to-Text-IA-Powered-Video-Transcription",
                "youtube": "",
                "technologies": ["HTML", "CSS", "Node", "OpenAI", "JavaScript"],
                "photo": "/img/projects/project4.png",
                "status": "Completed🟢"
            },
            "project5": {
                "title": "Simple Bootstrap Page",
                "description": "Responsive site using the Bootstrap 5 framework",
                "text": "The project developed during the bootcamp is a responsive site using the Bootstrap 5 framework. The site features various sections such as home page, about us section, portfolio, testimonials, and contact form.",
                "link": "https://lisboaant.github.io/simple-page-with-Bootstrap-5/",
                "youtube": "https://youtu.be/4sosXZsdy-s?si=GxftZm5RU8it8ok4",
                "technologies": ["HTML", "Bootstrap", "JavaScript"],
                "photo": "/img/projects/project5.png",
                "status": "Completed🟢"
            },
            "project6": {
                "title": "Old Computer",
                "description": "Custom software for the SESCOMP event",
                "text": "The system simulates an old computer from the Cold War era, where the user needs to solve challenges to access vital information about a terrorist attack plan. The computer has three passwords that must be discovered within a limited time, while the user faces challenges related to Cold War history.",
                "link": "https://github.com/LisboaAnt/Simulacao_Computador_Antigo_SESCOMP",
                "youtube": "",
                "technologies": ["Python"],
                "photo": "/img/projects/project6.png",
                "status": "Completed🟢"
            },
            "project7": {
                "title": "Java Project",
                "description": "A Java project to explore OOP concepts",
                "text": "This is a Java project for article submission, created in collaboration with a team. We used JavaFX for the graphical interface, providing a user-friendly and interactive experience. During development, we followed an MVC methodology, starting with the definition of system requirements to ensure all necessary functionalities were covered.",
                "link": "https://github.com/LisboaAnt/POO_Software_Project",
                "youtube": "",
                "technologies": ["Java"],
                "photo": "/img/projects/project7.png",
                "status": "Completed🟢"
            },
            "project8": {
                "title": "Calendar",
                "description": "A course on React Big Calendar via YouTube",
                "text": "This project aims to guide you in harnessing the power of React Big Calendar through our comprehensive YouTube tutorial series. Whether you are a beginner or an experienced developer, follow along to learn everything from the basics to advanced customization.",
                "link": "https://lisboaant.github.io/React-Big-Calendar-Tutorial/",
                "youtube": "https://youtu.be/jO0w252GfAc?si=xN2O4X4cUlngPjuC",
                "technologies": ["REACT", "Bootstrap", "Jscript", "FIGMA"],
                "photo": "/img/projects/project1.png",
                "status": "Completed🟢"
            },
            "project9": {
                "title": "Tailwind spotify",
                "description": "Rebuilding Spotify with Tailwind",
                "text": "This project was a valuable opportunity to deepen my knowledge in Tailwind CSS, using Next.js 14 and TypeScript. Inspired by Rocket's course, we recreated the Spotify interface, applying modern web development techniques. It was a practical and enriching experience, exploring not only responsive design and dynamic functionalities, but also integrating advanced technologies to create an engaging user experience.",
                "link": "https://tailwind-spotify-ochre.vercel.app",
                "youtube": "https://youtu.be/YVI-q3idGiM?si=riKfjqPcj3jycKMK",
                "technologies": ["REACT", "NEXT", "Tscript", "Tailwind"],
                "photo": "/img/projects/project9.png",
                "status": "Completed🟢"
            },
            "project10": {
                "title": "List with Multiple Hosting",
                "description": "Separation of Front-end, Back-end, and Database",
                "text": "The project involves user registration, with the main challenge being the separation of the front-end, back-end, and database, each hosted on different platforms. The front-end was developed with React, TypeScript, and Tailwind, and hosted on Vercel. The back-end was implemented with Node.js, using JavaScript, routes with CORS, and Prisma for database connection, hosted on the Render platform. The chosen database was MongoDB, hosted on its own online database service. The project's main challenges included ensuring each part functioned independently and testing server response times, continually seeking ways to optimize requests.",
                "link": "https://user-register-front.vercel.app",
                "youtube": "",
                "technologies": ["REACT", "Tscript", "Jscript", "Tailwind", "MongoDB", "Nodejs"],
                "photo": "/img/projects/project10.png",
                "status": "Completed🟢"
            },
            "project11": {
                "title": "OpenGL Computer Graphics",
                "description": "A course on OpenGL with Python via YouTube",
                "text": "This repository contains two main projects developed using OpenGL and Python, focused on computer graphics. Both projects are independent and represent different aspects and complexities of computer graphics.",
                "link": "https://github.com/LisboaAnt/OpenGLPython",
                "youtube": "https://youtu.be/xg9d4q9i9K4?si=K846zfzpS5h4lzP2",
                "technologies": ["Python", "OpenGL"],
                "photo": "/img/projects/project2.png",
                "status": "In progress 🟡"
            },
            "project12": {
                "title": "OS Scheduler Calculator RM & EDF",
                "description": "Calculator for analyzing types of schedulers",
                "text": "This repository contains an Operating Systems (OS) project that aims to illustrate RM and EDF schedulers in a simple and visual way.",
                "link": "https://escalonamento-tarefas-antonio-lisboas-projects.vercel.app",
                "youtube": "",
                "technologies": ["JavaScript", "Next.js", "React"],
                "photo": "/img/projects/project12.png",
                "status": "Completed 🟢"
            },
            "project13": {
                "title": "Victoria 3 Random Laws",
                "description": "Random Law Selector in V3",
                "text": "This repository is about a project that randomizes the law panel of Victoria 3. It is built with Next.js, React, and TypeScript. The main challenge was dealing with Victoria's laws, as one law can block or require another. This part was developed using JavaScript to facilitate implementation.",
                "link": "https://victoria3randomcountrylaws.vercel.app",
                "youtube": "",
                "technologies": ["JavaScript", "TScript", "Next", "React"],
                "photo": "/img/projects/project13.png",
                "status": "Completed 🟢"
            }
        },

        "publication": {
            "title": "Publications"
        },

        "publications":{    
            "publication1": {
            "title": "Presentation at the University Meeting of the NERDS Database Cell",
            "description": "Expanding Data Persistence Possibilities",
            "text": "During the University Meetings held on November 8, 2023, the presentation of the Database Cell of the NERDS extension project took place. The team includes two additional persons: Emilio de A. Calvet and Yuri R. Ribeiro, in addition to the presenter Antônio L. The main objective of our presentation was to elucidate the detailed criteria that guided the choice of MongoDB and NoSQL for our application. We deeply explored how these technologies efficiently handle large volumes of educational data, a crucial challenge faced by NERDS. Furthermore, we highlighted how our differentiated approach enables scalability and flexibility in the storage and manipulation of this data, always aiming to optimize performance and information security. The active participation of our team, composed of experienced and dedicated professionals, reinforces our commitment to innovation and excellence in the field of educational technology."
            },
            "publication2": {
            "title": "MongoDB Workshop: From Basics to Advanced in NoSQL",
            "description": "Workshop held at UFC Russas with the NERDS project",
            "text": "The MongoDB Workshop held on November 17, 2023, as part of the NERDS Extension Project at UFC Russas, was a significant event. With over 30 participants, the workshop provided a comprehensive and practical introduction to MongoDB, one of today's most popular NoSQL database systems.\n\nThroughout the workshop, participants delved into the logic and practice of NoSQL, starting from basic fundamentals and progressing to advanced techniques. Essential concepts such as modeling unstructured data, schema flexibility, and the differences between MongoDB and traditional relational database systems were explored.\n\nA highlight was the detailed exploration of CRUD (Create, Read, Update, Delete) operations within MongoDB, empowering students to efficiently and scalably handle data. Additionally, advanced MongoDB features including indexing, aggregations, and file systems were covered, providing participants with a robust understanding of MongoDB's capabilities for real-world applications.\n\nThe instructional materials used during the workshop included practical examples and exercises that reinforced theoretical learning. Participants were able to immediately apply their new knowledge in practical projects, solidifying their understanding and preparing them to tackle challenges in developing modern, NoSQL-based applications.\n\nThis workshop not only expanded participants' horizons in the field of NoSQL databases but also strengthened collaboration and the spirit of learning within the academic community at UFC Russas. With positive feedback from students and growing interest in future editions, the MongoDB Workshop has established itself as an impactful educational initiative on campus."
            }
        }
        
    }
}