{
    "translation":{

        "NavBar":{
            "Letreiro": "🟢 DISPONIBLE PARA TRABAJO FREELANCER!!",
            "DownMenu": {
                "open": "Cerrar",
                "close": "Menú",
                "about": "sobre yo",
                "contact": "contacto",
                "work": "trabajo",
                "projects": "proyectos",
                "courses":"YouTube",
                "publications": "Artículos"
            }
        },

        "home": {
            "title": "Que pasa, soy ",
            "description": "Planifico, escribo y desarrollo aplicaciones web",
            "description2": "Me encantan los desafíos y siempre busco soluciones creativas.",
            "button": "¡Contrátame!",
            "aboutme": "Sobre mí", 
            "aboutme1": "Siempre me ha apasionado la tecnología y actualmente estoy dedicando tiempo a profundizar mis conocimientos en aplicaciones frontend, utilizando React y React Native. Me estoy especializando en esta área a través del uso de frameworks y bibliotecas como Next.js, entre otras."
        },

        "me":{
            "hi": "Saludos, un poco sobre mi.",
            "technologies": "Tecnologías",
            "about": "Mi nombre es Antonio Lisboa. Siempre he sido apasionado por la tecnología y actualmente me estoy dedicando a profundizar mis conocimientos en aplicaciones orientadas al front-end, utilizando React y React Native. Me estoy especializando en esta área mediante el uso de frameworks y bibliotecas como Next.js, entre otros. Además, he tenido contacto con preprocesadores como SASS/SCSS, Tailwind CSS y Bootstrap. También tengo experiencia en la gestión de versiones de código utilizando Git/GitHub y Gitflow.", 
            "about2": "Estoy cursando la carrera de Ciencias de la Computación en la UFC, donde tengo la oportunidad de expandir mis conocimientos y aplicarlos en proyectos prácticos. Con una amplia experiencia en bases de datos SQL y una sólida actuación como analista de datos en bases de datos NoSQL, incluyendo la realización de mini-cursos sobre el tema, también he desarrollado habilidades comunicativas a través de la participación en obras de teatro. A lo largo de mi trayectoria profesional, he adquirido habilidades valiosas como trabajo en equipo, proactividad, toma de decisiones y compromiso con los plazos.",
            "experience":"Experiencia profesional",
            "experience2":"Analista de Bases de Datos (MongoDB), NERDS, UFC","experience2.1":"Abril 2023 - Febrero 2024",
            "experience3":"Pasante de desarrollo Full Stack, LUDI, UFC","experience3.1":"Febrero de 2024 – presente",
            "curriculum": "Resumen profesional", "curriculum1": "Para más información descarga mi currículum"
        },

        "contact":{
            "title": "Contacto",
            "name": "Nombre",
            "message": "¿Qué tienes en mente?",
            "button":"Enviar",
            "error":{
                "message": "Mínimo 20 caracteres.",
                "name":"Mínimo 5 caracteres.",
                "email": "Correo electrónico no válido"
            }
        },

        "Footer": {
            "companyName": "Antônio Lisboa",
            "rightsReserved": "Todos los derechos reservados."
        },

        "project":{
            "title":"Mis proyectos",
            "technologies": "Tecnologías utilizadas",
            "click": "Página del proyecto"
        },
        
        "projects": {
            "project1": {
                
            },
            "project2": {
                "title": "Gráficos por Computadora OpenGL",
                "description": "Un curso de OpenGL con Python vía YouTube",
                "text": "Este repositorio contiene dos proyectos principales desarrollados utilizando OpenGL y Python, enfocados en gráficos por computadora. Ambos proyectos son independientes y representan diferentes aspectos y complejidades de los gráficos por computadora.",
                "link": "https://github.com/LisboaAnt/OpenGLPython",
                "youtube": "https://youtu.be/yaSgU_XS56M",
                "technologies": ["Python", "OpenGL"],
                "photo": "/img/projects/project2.png",
                "status": "Completado🟢"
            },
            "project3": {
                "title": "Juego con Turtle",
                "description": "Un juego en Python desarrollado con Turtle",
                "text": "Este juego fue desarrollado para el curso de FUP, iniciando la experiencia con Python y juegos.",
                "link": "https://github.com/LisboaAnt/Turtle-game-FUP",
                "youtube": "https://youtu.be/ImY4Rq1fjeY?si=Pnpz1hzYpookiEyn",
                "technologies": ["Python", "Turtle"],
                "photo": "/img/projects/project3.png",
                "status": "Completado🟢"
            },
            "project4": {
                "title": "YouTube Shorts a Texto IA",
                "description": "Convertir YouTube Shorts en texto",
                "text": "Este proyecto es una aplicación web que utiliza inteligencia artificial para convertir YouTube Shorts en texto, ofreciendo subtítulos automáticos.",
                "link": "https://github.com/LisboaAnt/YouTube-Shorts-to-Text-IA-Powered-Video-Transcription",
                "youtube": "",
                "technologies": ["HTML", "CSS", "Node", "OpenAI", "JavaScript"],
                "photo": "/img/projects/project4.png",
                "status": "Completado🟢"
            },
            "project5": {
                "title": "Página Simple con Bootstrap",
                "description": "Sitio responsivo utilizando el framework Bootstrap 5",
                "text": "El proyecto desarrollado durante el bootcamp es un sitio responsivo utilizando el framework Bootstrap 5. El sitio presenta varias secciones, como página de inicio, sección sobre nosotros, portafolio, testimonios y formulario de contacto.",
                "link": "https://lisboaant.github.io/simple-page-with-Bootstrap-5/",
                "youtube": "https://youtu.be/4sosXZsdy-s?si=GxftZm5RU8it8ok4",
                "technologies": ["HTML", "Bootstrap", "JavaScript"],
                "photo": "/img/projects/project5.png",
                "status": "Completado🟢"
            },
            "project6": {
                "title": "Computadora Antigua",
                "description": "Software a medida para el evento SESCOMP",
                "text": "El sistema simula una computadora antigua de la era de la Guerra Fría, donde el usuario necesita resolver desafíos para acceder a información vital sobre un plan de ataque terrorista. La computadora tiene tres contraseñas que deben descubrirse en un tiempo limitado, mientras el usuario enfrenta desafíos relacionados con la historia de la Guerra Fría.",
                "link": "https://github.com/LisboaAnt/Simulacao_Computador_Antigo_SESCOMP",
                "youtube": "",
                "technologies": ["Python"],
                "photo": "/img/projects/project6.png",
                "status": "Completado🟢"
            },
            "project7": {
                "title": "Proyecto Java",
                "description": "Un proyecto en Java para explorar los conceptos de POO",
                "text": "Este es un proyecto desarrollado en Java para la presentación de artículos, creado en colaboración con un equipo. Utilizamos JavaFX para la interfaz gráfica, proporcionando una experiencia de usuario amigable e interactiva. Durante el desarrollo, seguimos una metodología MVC, comenzando con la definición de los requisitos del sistema para asegurar que todas las funcionalidades necesarias fueran cubiertas.",
                "link": "https://github.com/LisboaAnt/POO_Software_Project",
                "youtube": "",
                "technologies": ["Java"],
                "photo": "/img/projects/project7.png",
                "status": "Completado🟢"
            },
            "project8": {
                "title": "Calendario",
                "description": "Un curso de React Big Calendar vía YouTube",
                "text": "Este proyecto tiene como objetivo guiarte en el aprovechamiento del poder de React Big Calendar a través de nuestra serie de tutoriales en YouTube. Ya seas un desarrollador principiante o experimentado, sigue para aprender todo, desde lo básico hasta la personalización avanzada.",
                "link": "https://lisboaant.github.io/React-Big-Calendar-Tutorial/",
                "youtube": "https://youtu.be/jO0w252GfAc?si=xN2O4X4cUlngPjuC",
                "technologies": ["REACT", "Bootstrap", "Jscript", "FIGMA"],
                "photo": "/img/projects/project1.png",
                "status": "Completado🟢"
            }
        },

        "publication": {
            "title": "Artículos"
        },

        "publications":{    
            "publication1": {
                "title": "MongoDB: Experiencias y Aprendizajes en NoSQL",
                "description": "Transformación de Datos con Herramientas como PyPandas",
                "text": "En los últimos meses, me he sumergido en el mundo de MongoDB, una poderosa base de datos NoSQL que ofrece un enfoque flexible y escalable para el almacenamiento de datos. Durante este período de estudio y práctica, he acumulado una amplia gama de experiencias y aprendizajes que han enriquecido mi comprensión sobre la gestión de datos no relacionales. Una de las actividades más significativas que realicé fue la transformación de datos de hojas de cálculo a MongoDB utilizando la biblioteca PyPandas. Esta herramienta resultó esencial para la manipulación y limpieza de grandes volúmenes de datos, permitiéndome preparar y cargar información de manera eficiente y precisa. A lo largo de este viaje, enfrenté diversos desafíos que me ayudaron a profundizar mi conocimiento sobre la arquitectura y las funcionalidades de MongoDB. Aprendí a crear y gestionar colecciones, a utilizar operadores avanzados para consultas complejas y a optimizar el rendimiento de las operaciones de la base de datos. Además, exploré las mejores prácticas de modelado de datos en el contexto NoSQL, garantizando que mis aplicaciones fueran robustas y escalables. El uso combinado de PyPandas y MongoDB demostró ser una estrategia poderosa para proyectos que requieren flexibilidad en la estructuración de datos y rapidez en el procesamiento de grandes conjuntos de información. Este aprendizaje no solo amplió mis habilidades técnicas, sino que también me preparó para enfrentar futuras demandas en el campo del análisis y la gestión de datos. En resumen, mi experiencia con MongoDB ha sido extremadamente enriquecedora. La práctica constante y la aplicación de herramientas complementarias como PyPandas me permitieron explorar todo el potencial de la base de datos NoSQL, consolidando mi capacidad para manejar desafíos complejos de datos en diferentes contextos."
            }
        }

    }
}