{
    "translation":{

        "NavBar":{
            "Letreiro": "🟢 DISPONIBLE PARA TRABAJO FREELANCER!!",
            "DownMenu": {
                "open": "Cerrar",
                "close": "Menú",
                "about": "sobre yo",
                "contact": "contacto",
                "work": "trabajo",
                "projects": "proyectos",
                "courses":"Cursos"
            }
        },

        "home": {
            "title": "Que pasa, soy ",
            "description": "Planifico, escribo y desarrollo aplicaciones web",
            "description2": "Me encantan los desafíos y siempre busco soluciones creativas.",
            "button": "¡Contrátame!"  
        },

        "me":{
            "hi": "Saludos, un poco sobre mi.",
            "technologies": "Tecnologías",
            "about": "Siempre he sido apasionado por la tecnología y actualmente me estoy dedicando a profundizar mis conocimientos en aplicaciones orientadas al front-end, utilizando React y React Native. Me estoy especializando en esta área mediante el uso de frameworks y bibliotecas como Next.js, entre otros. Además, he tenido contacto con preprocesadores como SASS/SCSS, Tailwind CSS y Bootstrap. También tengo experiencia en la gestión de versiones de código utilizando Git/GitHub y Gitflow.", 
            "about2": "Estoy cursando la carrera de Ciencias de la Computación en la UFC, donde tengo la oportunidad de expandir mis conocimientos y aplicarlos en proyectos prácticos. Con una amplia experiencia en bases de datos SQL y una sólida actuación como analista de datos en bases de datos NoSQL, incluyendo la realización de mini-cursos sobre el tema, también he desarrollado habilidades comunicativas a través de la participación en obras de teatro. A lo largo de mi trayectoria profesional, he adquirido habilidades valiosas como trabajo en equipo, proactividad, toma de decisiones y compromiso con los plazos.",
            "experience":"Experiencia profesional",
            "experience2":"Analista de Bases de Datos (MongoDB), NERDS, UFC","experience2.1":"Abril 2023 - Febrero 2024",
            "experience3":"Pasante de desarrollo Full Stack, LUDI, UFC","experience3.1":"Febrero de 2024 – presente",
            "curriculum": "Resumen profesional", "curriculum1": "Para más información descarga mi currículum"
        },

        "contact":{
            "title": "Contacto",
            "name": "Nombre",
            "message": "¿Qué tienes en mente?",
            "button":"Enviar",
            "error":{
                "message": "Mínimo 20 caracteres.",
                "name":"Mínimo 5 caracteres.",
                "email": "Correo electrónico no válido"
            }
        },

        "projects":{
            "title":"Mis proyectos"
        },

        "Footer": {
            "companyName": "Antônio Lisboa",
            "rightsReserved": "Todos los derechos reservados."
        }
    }
}