{
    "translation":{

        "NavBar":{
            "Letreiro": "   🟢 DISPONIBLE PARA TRABAJO FREELANCER!! ",
            "DownMenu": {
                "open": "Cerrar",
                "close": "Menú",
                "about": "sobre yo",
                "contact": "contacto",
                "work": "trabajo",
                "projects": "proyectos",
                "courses":"YouTube",
                "publications": "Artículos"
            }
        },

        "home": {
            "title": "Hola, soy ",
            "description": "Planifico, escribo y desarrollo aplicaciones web",
            "description2": "Me encantan los desafíos y siempre busco soluciones creativas.",
            "button": "¡Contrátame!",
            "aboutme": "Sobre mí", 
            "aboutme1": "Siempre me ha apasionado la tecnología y actualmente estoy dedicando tiempo a profundizar mis conocimientos en aplicaciones frontend, utilizando React y React Native. Me estoy especializando en esta área a través del uso de frameworks y bibliotecas como Next.js, entre otras."
        },

        "me":{
            "hi": "Saludos, un poco sobre mi.",
            "technologies": "Tecnologías",
            "about": "Mi nombre es Antonio Lisboa. Siempre he sido apasionado por la tecnología y actualmente me estoy dedicando a profundizar mis conocimientos en aplicaciones orientadas al front-end, utilizando React y React Native. Me estoy especializando en esta área mediante el uso de frameworks y bibliotecas como Next.js, entre otros. Además, he tenido contacto con preprocesadores como SASS/SCSS, Tailwind CSS y Bootstrap. También tengo experiencia en la gestión de versiones de código utilizando Git/GitHub y Gitflow.", 
            "about2": "Estoy cursando la carrera de Ciencias de la Computación en la UFC, donde tengo la oportunidad de expandir mis conocimientos y aplicarlos en proyectos prácticos. Con una amplia experiencia en bases de datos SQL y una sólida actuación como analista de datos en bases de datos NoSQL, incluyendo la realización de mini-cursos sobre el tema, también he desarrollado habilidades comunicativas a través de la participación en obras de teatro. A lo largo de mi trayectoria profesional, he adquirido habilidades valiosas como trabajo en equipo, proactividad, toma de decisiones y compromiso con los plazos.",
            "experience":"Experiencia profesional",
            "experience2":"Analista de Bases de Datos (MongoDB), NERDS, UFC","experience2.1":"Abril 2023 - Febrero 2024",
            "experience3":"Pasante de desarrollo Full Stack, LUDI, UFC","experience3.1":"Febrero de 2024 – presente",
            "curriculum": "Resumen profesional", "curriculum1": "Para más información descarga mi currículum"
        },

        "contact":{
            "title": "Contacto",
            "name": "Nombre",
            "message": "¿Qué tienes en mente?",
            "button":"Enviar",
            "error":{
                "message": "Mínimo 20 caracteres.",
                "name":"Mínimo 5 caracteres.",
                "email": "Correo electrónico no válido"
            }
        },

        "Footer": {
            "companyName": "Antônio Lisboa",
            "rightsReserved": "Todos los derechos reservados."
        },

        "project":{
            "title":"Mis proyectos",
            "technologies": "Tecnologías utilizadas",
            "click": "Página del proyecto"
        },
        
        "projects": {
            "project3": {
                "title": "Juego con Turtle",
                "description": "Un juego en Python desarrollado con Turtle",
                "text": "Este juego fue desarrollado para el curso de FUP, iniciando la experiencia con Python y juegos.",
                "link": "https://github.com/LisboaAnt/Turtle-game-FUP",
                "youtube": "https://youtu.be/ImY4Rq1fjeY?si=Pnpz1hzYpookiEyn",
                "technologies": ["Python", "Turtle"],
                "photo": "/img/projects/project3.png",
                "status": "Completado🟢"
            },
            "project4": {
                "title": "YouTube Shorts a Texto IA",
                "description": "Convertir YouTube Shorts en texto",
                "text": "Este proyecto es una aplicación web que utiliza inteligencia artificial para convertir YouTube Shorts en texto, ofreciendo subtítulos automáticos.",
                "link": "https://github.com/LisboaAnt/YouTube-Shorts-to-Text-IA-Powered-Video-Transcription",
                "youtube": "",
                "technologies": ["HTML", "CSS", "Node", "OpenAI", "JavaScript"],
                "photo": "/img/projects/project4.png",
                "status": "Completado🟢"
            },
            "project5": {
                "title": "Página Simple con Bootstrap",
                "description": "Sitio responsivo utilizando el framework Bootstrap 5",
                "text": "El proyecto desarrollado durante el bootcamp es un sitio responsivo utilizando el framework Bootstrap 5. El sitio presenta varias secciones, como página de inicio, sección sobre nosotros, portafolio, testimonios y formulario de contacto.",
                "link": "https://lisboaant.github.io/simple-page-with-Bootstrap-5/",
                "youtube": "https://youtu.be/4sosXZsdy-s?si=GxftZm5RU8it8ok4",
                "technologies": ["HTML", "Bootstrap", "JavaScript"],
                "photo": "/img/projects/project5.png",
                "status": "Completado🟢"
            },
            "project6": {
                "title": "Computadora Antigua",
                "description": "Software a medida para el evento SESCOMP",
                "text": "El sistema simula una computadora antigua de la era de la Guerra Fría, donde el usuario necesita resolver desafíos para acceder a información vital sobre un plan de ataque terrorista. La computadora tiene tres contraseñas que deben descubrirse en un tiempo limitado, mientras el usuario enfrenta desafíos relacionados con la historia de la Guerra Fría.",
                "link": "https://github.com/LisboaAnt/Simulacao_Computador_Antigo_SESCOMP",
                "youtube": "",
                "technologies": ["Python"],
                "photo": "/img/projects/project6.png",
                "status": "Completado🟢"
            },
            "project7": {
                "title": "Proyecto Java",
                "description": "Un proyecto en Java para explorar los conceptos de POO",
                "text": "Este es un proyecto desarrollado en Java para la presentación de artículos, creado en colaboración con un equipo. Utilizamos JavaFX para la interfaz gráfica, proporcionando una experiencia de usuario amigable e interactiva. Durante el desarrollo, seguimos una metodología MVC, comenzando con la definición de los requisitos del sistema para asegurar que todas las funcionalidades necesarias fueran cubiertas.",
                "link": "https://github.com/LisboaAnt/POO_Software_Project",
                "youtube": "",
                "technologies": ["Java"],
                "photo": "/img/projects/project7.png",
                "status": "Completado🟢"
            },
            "project8": {
                "title": "Calendario",
                "description": "Un curso de React Big Calendar vía YouTube",
                "text": "Este proyecto tiene como objetivo guiarte en el aprovechamiento del poder de React Big Calendar a través de nuestra serie de tutoriales en YouTube. Ya seas un desarrollador principiante o experimentado, sigue para aprender todo, desde lo básico hasta la personalización avanzada.",
                "link": "https://lisboaant.github.io/React-Big-Calendar-Tutorial/",
                "youtube": "https://youtu.be/jO0w252GfAc?si=xN2O4X4cUlngPjuC",
                "technologies": ["REACT", "Bootstrap", "Jscript", "FIGMA"],
                "photo": "/img/projects/project1.png",
                "status": "Completado🟢"
            },
            "project9": {
                "title": "Tailwind spotify",
                "description": "Reconstruyendo Spotify con Tailwind",
                "text": "Este proyecto fue una oportunidad valiosa para profundizar mis conocimientos en Tailwind CSS, utilizando Next.js 14 y TypeScript. Inspirado por el curso de Rocket, recreamos la interfaz de Spotify, aplicando técnicas modernas de desarrollo web. Fue una experiencia práctica y enriquecedora, explorando no solo el diseño responsive y las funcionalidades dinámicas, sino también la integración de tecnologías avanzadas para crear una experiencia de usuario envolvente.",
                "link": "https://tailwind-spotify-ochre.vercel.app",
                "youtube": "https://youtu.be/YVI-q3idGiM?si=riKfjqPcj3jycKMK",
                "technologies": ["REACT", "NEXT", "Tscript", "Tailwind"],
                "photo": "/img/projects/project9.png",
                "status": "Concluido🟢"
            },
            "project10": {
                "title": "Lista con hosting múltiple",
                "description": "Separación de Front-end, Back-end y Base de Datos",
                "text": "El proyecto implica el registro de usuarios, con el principal desafío de separar el front-end, el back-end y la base de datos, cada uno alojado en diferentes plataformas. El front-end fue desarrollado con React, TypeScript y Tailwind, y alojado en Vercel. El back-end se implementó con Node.js, utilizando JavaScript, rutas con CORS y Prisma para la conexión con la base de datos, alojado en la plataforma Render. La base de datos elegida fue MongoDB, alojada en su propio servicio de base de datos en línea. Los principales desafíos del proyecto incluyeron asegurar que cada parte funcionara de manera independiente y probar los tiempos de respuesta del servidor, buscando continuamente formas de optimizar las solicitudes.",
                "link": "https://user-register-front.vercel.app",
                "youtube": "",
                "technologies": ["REACT", "Tscript", "Jscript", "Tailwind", "MongoDB", "Nodejs"],
                "photo": "/img/projects/project10.png",
                "status": "Concluido🟢"
            },
            "project11": {
                "title": "Gráficos por Computadora OpenGL",
                "description": "Un curso de OpenGL con Python vía YouTube",
                "text": "Este repositorio contiene dos proyectos principales desarrollados utilizando OpenGL y Python, enfocados en gráficos por computadora. Ambos proyectos son independientes y representan diferentes aspectos y complejidades de los gráficos por computadora.",
                "link": "https://github.com/LisboaAnt/OpenGLPython",
                "youtube": "https://youtu.be/xg9d4q9i9K4?si=K846zfzpS5h4lzP2",
                "technologies": ["Python", "OpenGL"],
                "photo": "/img/projects/project2.png",
                "status": "En andamiento 🟡"
            },
            "project12": {
                "title": "Calculadora de SO Planificadores RM & EDF",
                "description": "Calculadora para analizar los tipos de planificadores",
                "text": "Este repositorio contiene un proyecto de Sistemas Operativos (SO) que busca ejemplificar de forma simple y visual los planificadores RM y EDF.",
                "link": "https://escalonamento-tarefas-antonio-lisboas-projects.vercel.app",
                "youtube": "",
                "technologies": ["JavaScript", "Next.js", "React"],
                "photo": "/img/projects/project12.png",
                "status": "Concluido 🟢"
            },
            "project13": {
                "title": "Leyes Aleatorias de Victoria 3",
                "description": "Selector de Leyes Aleatorias en V3",
                "text": "Este repositorio trata sobre un proyecto que aleatoriza el panel de leyes de Victoria 3. Está construido con Next.js, React y TypeScript. El principal desafío fue lidiar con las leyes de Victoria, ya que una ley puede bloquear o requerir otra. Esta parte fue desarrollada usando JavaScript para facilitar la implementación.",
                "link": "https://victoria3randomcountrylaws.vercel.app",
                "youtube": "",
                "technologies": ["JavaScript", "TScript", "Next", "React"],
                "photo": "/img/projects/project13.png",
                "status": "Completado 🟢"
            },
            "project14": {
            "title": "TRON TRAILER | Studio LISBOA",
            "description": "Juego inspirado en la película TRON de Disney",
            "text": "Juego inspirado en la clásica película TRON de Disney, desarrollado por Studio LISBOA. Este proyecto fue creado utilizando OpenGL y Python, recreando los elementos visuales y dinámicos del universo TRON en un juego interactivo.",
            "link": "https://youtu.be/speVigR8A-Q",
            "youtube": "https://youtu.be/speVigR8A-Q",
            "technologies": ["Python", "OpenGL"],
            "photo": "/img/projects/project14.png",
            "status": "Completado 🟢"
            },
            "project15": {
            "title": "Sitio de Portafolio de Fotografía",
            "description": "Aplicación WEB en Next.js con Frame Motion",
            "text": "Presentamos el Portafolio de Fotografía, una aplicación web dinámica construida con Next.js que muestra el trabajo de fotógrafos profesionales de manera interactiva. Utilizando carga asíncrona y animaciones suaves con Frame Motion, el sitio garantiza una experiencia de navegación optimizada y atractiva. Cada sección del portafolio presenta imágenes de alta calidad con transiciones elegantes, permitiendo que los clientes potenciales exploren fácilmente las habilidades y el estilo del fotógrafo. La arquitectura de Next.js garantiza rendimiento y escalabilidad, convirtiendo este portafolio en una herramienta efectiva para atraer nuevos clientes y resaltar la esencia creativa de la fotografía.",
            "link": "https://animated-page-framer-motion.vercel.app",
            "youtube": "https://youtu.be/xslcIhBpFvo",
            "technologies": ["Next", "JavaScript", "React"],
            "photo": "/img/projects/project15.png",
            "status": "Completo 🟢"
            }

        },

        "publication": {
            "title": "Artículos"
        },

        "publications":{    
            "publication1": {
            "title": "Presentación en el Encuentro Universitario de la Célula de Base de Datos NERDS",
            "description": "Ampliando las Posibilidades de Persistencia de Datos",
            "text": "Durante los Encuentros Universitarios celebrados el 8 de noviembre de 2023, se llevó a cabo la presentación de la célula de Base de Datos del proyecto de extensión NERDS. El equipo incluye a dos personas más: Emilio de A. Calvet y Yuri R. Ribeiro, además del presentador Antônio L. El objetivo principal de nuestra presentación fue elucidar los criterios detallados que guiaron la elección de MongoDB y NoSQL para nuestra aplicación. Exploramos en profundidad cómo estas tecnologías permiten manejar de manera eficiente grandes volúmenes de datos educativos, un desafío crucial enfrentado por NERDS. Además, destacamos cómo nuestro enfoque diferenciado permite escalabilidad y flexibilidad en el almacenamiento y manipulación de estos datos, siempre buscando optimizar el rendimiento y la seguridad de la información. La participación activa de nuestro equipo, compuesto por profesionales experimentados y dedicados, refuerza nuestro compromiso con la innovación y la excelencia en el campo de la tecnología educativa."
            },
            "publication2": {
            "title": "Minicurso MongoDB: Desde lo Básico hasta Avanzado en NoSQL",
            "description": "Minicurso impartido en la UFC Russas con el proyecto NERDS",
            "text": "El Minicurso de MongoDB realizado el 17 de noviembre de 2023 como parte del Proyecto de Extensión NERDS en la UFC Russas fue un evento destacado. Con la participación de más de 30 estudiantes, el curso ofreció una introducción amplia y práctica a MongoDB, uno de los sistemas de bases de datos NoSQL más populares en la actualidad.\n\nDurante el curso, los participantes se sumergieron en la lógica y práctica de NoSQL, comenzando desde los fundamentos básicos y avanzando hacia técnicas más avanzadas. Exploramos conceptos esenciales como modelado de datos no estructurados, flexibilidad de esquemas y las diferencias entre MongoDB y los sistemas de bases de datos relacionales tradicionales.\n\nUno de los puntos destacados fue el detallado estudio del CRUD (Create, Read, Update, Delete) en el contexto de MongoDB, capacitando a los estudiantes para manejar datos de manera eficiente y escalable. Además, exploramos las características avanzadas de MongoDB, incluyendo índices, agregaciones y sistemas de archivos, proporcionando a los participantes un entendimiento sólido de las capacidades de MongoDB para aplicaciones del mundo real.\n\nEl material didáctico utilizado durante el curso incluyó ejemplos prácticos y ejercicios que reforzaron el aprendizaje teórico. Los participantes pudieron aplicar inmediatamente sus nuevos conocimientos en proyectos prácticos, consolidando su comprensión y preparándolos para enfrentar desafíos en el desarrollo de aplicaciones modernas basadas en NoSQL.\n\nEste minicurso no solo amplió el horizonte de los participantes en el campo de las bases de datos NoSQL, sino que también fortaleció la colaboración y el espíritu de aprendizaje en la comunidad académica de la UFC Russas. Con comentarios positivos de los estudiantes y un creciente interés en futuras ediciones, el minicurso de MongoDB se ha establecido como una iniciativa educativa de gran impacto en el campus."
            }

        }

    }
}