{
    "translation":{

        "NavBar":{
            "Letreiro": "   🟢 DISPONÍVEL PARA TRABALHO FREELANCER!!  ",
            "DownMenu": {
                "open": "Fechar",
                "close": "Menu",
                "about": "Sobre Mim",
                "contact": "contato",
                "work": "trabalho",
                "projects": "projetos",
                "courses":"YouTube",
                "publications": "Publicações"
            }
        },
    
        "home": {
            "title": "Olá, eu sou o ",
            "description": "Planejo, escrevo e desenvolvo aplicações web",
            "description2": "Tenho paixão por desafios e estou constantemente em busca de soluções criativas para problemas complexos.",
            "button": "Me contrate!",
            "aboutme":"Sobre mim",
            "aboutme1":"Sempre fui apaixonado por tecnologia e atualmente estou me dedicando a aprofundar meus conhecimentos em aplicações voltadas para front-end, utilizando React e React Native. Estou me especializando nesta área através da utilização de frameworks e bibliotecas como Next.js, entre outras. "
        },
        
        "me":{
            "hi": "Saudações, um pouco sobre mim.",
            "technologies": "Tecnologias",
            "about": "Meu nome é Antônio Lisboa. Sempre fui apaixonado por tecnologia e atualmente venho me dedicando a aprofundar meus conhecimentos em aplicações voltadas para o front-end, utilizando React e React Native. Estou me especializando nesta área através do uso de frameworks e bibliotecas como Next.js, entre outros. Além disso, tive contato com pré-processadores, como o SASS/SCSS, Tailwind CSS e Bootstrap. Também tenho experiência no versionamento de código utilizando Git/GitHub e Gitflow.",
            "about2": "Faço faculdade de Ciências da Computação na UFC, onde tenho a oportunidade de expandir meus conhecimentos e aplicá-los em projetos práticos. Com ampla experiência em bancos SQL e uma sólida atuação como analista de dados em bancos NoSQL, incluindo a realização de mini-cursos sobre o assunto, desenvolvi também habilidades comunicativas através da participação em peças teatrais. Ao longo de minha jornada profissional, adquiri habilidades valiosas como trabalho em equipe, proatividade, tomada de decisões e comprometimento com prazos.",
            "experience":"Experiência profissional",
            "experience2":"Analista de Banco da dados (MongoDB), NERDS, UFC","experience2.1":"Abril 2023 - Fevereiro 2024",
            "experience3":"Estagiário desenvolvedor Full Stack, LUDI, UFC","experience3.1":"Fevereiro 2024 - presente",
            "curriculum": "Currículo", "curriculum1": "Para mais informações, baixe meu currículo"
        },
    
        "contact":{
            "title": "Contato",
            "name": "Nome",
            "message": "O que você tem em mente?",
            "button":"Enviar",
            "error":{
                "message": "Mínimo 20 caracteres.",
                "name":"Mínimo 5 caracteres.",
                "email":"E-mail inválido"
            }
        },

        "Footer": {
            "companyName": "Antônio Lisboa",
            "rightsReserved": "Todos os direitos reservados."
        },

        "project":{
            "title":"Meus Projetos",
            "technologies": "Tecnologias Utilizadas",
            "click": "Página do projeto"
        },
        
        
        "projects": {
            "project3":{
                "title": "Jogo com Turtle",
                "description": "Um jogo em python desenvolvido com turtle",
                "text": "Este jogo foi densolvido para a cadeira de FUP, inicializando a experiência com pyhton e jogos.",
                "link": "https://github.com/LisboaAnt/Turtle-game-FUP",
                "youtube":"https://youtu.be/ImY4Rq1fjeY?si=Pnpz1hzYpookiEyn",
                "technologies": ["Python", "Turtle"],
                "photo": "/img/projects/project3.png",
                "status": "Concluído🟢"
            },
            "project4":{
                "title": "YouTube Shorts to Text IA",
                "description": "Converter vídeos curtos (Shorts) do YouTube em texto",
                "text": "Este projeto é uma aplicação web que utiliza uma Inteligência Artificial para converter vídeos curtos (Shorts) do YouTube em texto, oferecendo legendas automaticamente.",
                "link": "https://github.com/LisboaAnt/YouTube-Shorts-to-Text-IA-Powered-Video-Transcription",
                "youtube":"",
                "technologies": ["HTML", "CSS", "Node", "OpenAI", "JavaScript"],
                "photo": "/img/projects/project4.png",
                "status": "Concluído🟢"
            },
            "project5":{
                "title": "Pagina simples Bootstrap",
                "description": "Site responsivo utilizando o framework Bootstrap 5",
                "text": "O projeto desenvolvido durante o bootcamp é um site responsivo utilizando o framework Bootstrap 5. O site apresenta várias seções, como página inicial, seção de sobre nós, portfólio, depoimentos e formulário de contato.",
                "link": "https://lisboaant.github.io/simple-page-with-Bootstrap-5/",
                "youtube":"https://youtu.be/4sosXZsdy-s?si=GxftZm5RU8it8ok4",
                "technologies": ["HTML", "Bootstrap", "JavaScript"],
                "photo": "/img/projects/project5.png",
                "status": "Concluído🟢"
            },
            "project6":{
                "title": "Computador Antigo",
                "description": "Software sob demanda para o evento SESCOMP",
                "text": "O sistema simula um computador antigo da era da Guerra Fria, onde o usuário precisa resolver desafios para acessar informações vitais sobre um plano de ataque terrorista. O computador possui três senhas que devem ser descobertas em um período de tempo limitado, enquanto o usuário enfrenta desafios relacionados à história da Guerra Fria.",
                "link": "https://github.com/LisboaAnt/Simulacao_Computador_Antigo_SESCOMP",
                "youtube":"",
                "technologies": ["Python"],
                "photo": "/img/projects/project6.png",
                "status": "Concluído🟢"
            },
            "project7":{
                "title": "Java Project",
                "description": "Um projeto em Java para exploraros conceitos de POO",
                "text": "Este é um projeto desenvolvido em Java para a submissão de artigos, criado em colaboração com uma equipe. Utilizamos JavaFX para a interface gráfica, proporcionando uma experiência de usuário amigável e interativa. Durante o desenvolvimento, seguimos uma metodologia MVC, começando pela definição dos requisitos do sistema para garantir que todas as funcionalidades necessárias fossem contempladas.",
                "link": "https://github.com/LisboaAnt/POO_Software_Project",
                "youtube":"",
                "technologies": ["Java"],
                "photo": "/img/projects/project7.png",
                "status": "Concluído🟢"
            },
            "project8":{
                "title": "Calendário",
                "description": "Um curso do React Big Calendar via youtube",
                "text": "Este projeto tem como objetivo orientá-lo no aproveitamento do poder do React Big Calendar por meio de nossa abrangente série de tutoriais no YouTube. Quer você seja um desenvolvedor iniciante ou experiente, acompanhe para aprender tudo, desde o básico até a personalização avançada.",
                "link": "https://lisboaant.github.io/React-Big-Calendar-Tutorial/",
                "youtube":"https://youtu.be/jO0w252GfAc?si=xN2O4X4cUlngPjuC",
                "technologies": ["REACT", "Bootstrap", "Jscript", "FIGMA"],
                "photo": "/img/projects/project1.png",
                "status": "Concluído🟢"
            },
            "project9":{
                "title": "Tailwind spotify",
                "description": "Reconstruindo spotify com Tailwind ",
                "text": "Este projeto foi uma oportunidade valiosa para aprofundar meus conhecimentos em Tailwind CSS, utilizando Next.js 14 e TypeScript. Inspirado pelo curso da Rocket, recriamos a interface do Spotify, aplicando técnicas modernas de desenvolvimento web. Foi uma experiência prática e enriquecedora, explorando não apenas o design responsivo e funcionalidades dinâmicas, mas também a integração de tecnologias avançadas para criar uma experiência de usuário envolvente",
                "link": "https://tailwind-spotify-ochre.vercel.app",
                "youtube":"https://youtu.be/YVI-q3idGiM?si=riKfjqPcj3jycKMK",
                "technologies": ["REACT", "NEXT", "Tscript", "Tailwind"],
                "photo": "/img/projects/project9.png",
                "status": "Concluído🟢"
            },
            "project10":{
                "title": "Lista com Múltiplas Hospedagem",
                "description": "Separação de Front-end, Back-end e Banco de Dados",
                "text": "Hospedagem em Múltiplas Plataformas. O projeto realiza o registro de usuário, sendo o principal desafio separar o front-end, o back-end e o banco de dados, hospedando cada um em plataformas diferentes. O front-end foi desenvolvido com React, TypeScript e Tailwind, e hospedado na Vercel. O back-end foi implementado com Node.js, utilizando JavaScript, rotas com CORS e Prisma para a conexão com o banco de dados, sendo hospedado na plataforma Render. O banco de dados escolhido foi o MongoDB, hospedado em seu próprio serviço de banco de dados online. Os maiores desafios do projeto incluíram garantir que cada parte funcionasse de forma independente e testar o tempo de resposta dos servidores, buscando continuamente formas de otimizar as requisições.",
                "link": "https://user-register-front.vercel.app",
                "youtube":"",
                "technologies": ["REACT", "Tscript", "Jscript", "Tailwind", "MongoDB", "Nodejs"],
                "photo": "/img/projects/project10.png",
                "status": "Concluído🟢"
            },
            "project11":{
                "title": "OpenGL Computação Gráfica",
                "description": "Um curso de OpenGl com python via youtube",
                "text": "Este repositório contém dois projetos principais desenvolvidos utilizando OpenGL e Python, focados em computação gráfica. Ambos os projetos são independentes e representam diferentes aspectos e complexidades da computação gráfica.",
                "link": "https://github.com/LisboaAnt/OpenGLPython",
                "youtube":"https://youtu.be/xg9d4q9i9K4?si=K846zfzpS5h4lzP2",
                "technologies": ["Python", "OpenGL"],
                "photo": "/img/projects/project2.png",
                "status": "Em andamento🟡"
            },
            "project12": {
                "title": "SO Calculadora Escalonadores RM & EDF",
                "description": "Calculadora para analisar os tipos de escalonadores",
                "text": "Este repositório contém um projeto de Sistemas Operacionais (SO) que busca exemplificar de forma simples e visual os escalonadores RM e EDF.",
                "link": "https://escalonamento-tarefas-antonio-lisboas-projects.vercel.app",
                "youtube": "",
                "technologies": ["JavaScript", "Next.js", "React"],
                "photo": "/img/projects/project12.png",
                "status": "Concluído 🟢"
            }
        },


        "publication": {
            "title": "Publicações"
        },

        "publications":{
            "publication1": {
            "title": "Apresentação no Encontro Universitário da Célula de Banco de Dados NERDS",
            "description": "Ampliando as Possibilidades de Persistência de Dados",
            "text": "Durante os Encontros Universitários realizados em 8 de novembro de 2023, ocorreu a apresentação da célula de Banco de Dados do projeto de extensão NERDS. A equipe inclui mais duas pessoas: Emilio de A. Calvet e Yuri R. Ribeiro, além do apresentador Antônio L. O objetivo principal da nossa apresentação foi elucidar os critérios detalhados que nortearam a escolha do MongoDB e do NoSQL para nossa aplicação. Exploramos profundamente como essas tecnologias permitem lidar de maneira eficiente com grandes volumes de dados educacionais, um desafio crucial enfrentado pelo NERDS. Além disso, destacamos como nossa abordagem diferenciada possibilita escalabilidade e flexibilidade no armazenamento e manipulação desses dados, visando sempre a otimização do desempenho e a segurança da informação. A participação ativa de nossa equipe, composta por profissionais experientes e dedicados, reforça nosso compromisso com a inovação e a excelência no campo da tecnologia educacional."
            },

            "publication2": {
                "title": "Minicurso MongoDB: Do Básico ao Avançado em NoSQL",
                "description": "Minicurso aplicado na UFC Russas com o projeto NERDS",
                "text": "O Minicurso de MongoDB realizado em 17 de novembro de 2023 como parte do Projeto de Extensão NERDS na UFC Russas foi um evento marcante. Com a participação de mais de 30 alunos, o curso proporcionou uma introdução abrangente e prática ao MongoDB, um dos bancos de dados NoSQL mais populares da atualidade.\n\nDurante o curso, os participantes mergulharam na lógica e na prática do NoSQL, começando pelos fundamentos básicos e progredindo até técnicas avançadas. Exploramos conceitos essenciais como modelagem de dados não estruturados, flexibilidade do esquema, e como o MongoDB difere dos sistemas de banco de dados relacionais tradicionais.\n\nUm dos destaques foi a abordagem detalhada do CRUD (Create, Read, Update, Delete) no contexto do MongoDB, capacitando os alunos a manipular dados de forma eficiente e escalável. Além disso, exploramos os recursos avançados do MongoDB, incluindo índices, agregações e sistemas de arquivos, oferecendo aos participantes uma compreensão robusta das capacidades do MongoDB para aplicações do mundo real.\n\nO material didático utilizado durante o curso incluiu exemplos práticos e exercícios que reforçaram o aprendizado teórico. Os participantes puderam aplicar imediatamente seus novos conhecimentos em projetos práticos, consolidando seu entendimento e preparando-os para enfrentar desafios no desenvolvimento de aplicações modernas baseadas em NoSQL.\n\nEste minicurso não apenas ampliou o horizonte dos participantes no campo dos bancos de dados NoSQL, mas também fortaleceu a colaboração e o espírito de aprendizagem na comunidade acadêmica da UFC Russas. Com feedback positivo dos alunos e interesse crescente em futuras edições, o minicurso de MongoDB se consolidou como uma iniciativa educacional de grande impacto no campus."
            }

        }
        
        
    }
}